org-roam/rothstein92_midi.org
:PROPERTIES:
:ID:       baeac79c-4521-4f63-b8c4-c209747e4532
:ROAM_REFS: cite:rothstein92_midi
:END:
#+TITLE: rothstein92_midi

* Midi: a comprehensive introduction
:PROPERTIES:
:Custom_ID: rothstein92_midi
:URL: 
:AUTHOR: Rothstein, J.
:NOTER_DOCUMENT: 
:NOTER_PAGE:
:END:

** page 1 What is MIDI
MIDI is an acronym for "Musical Instrument Digital Interface." Despite its impact on the world of music, MIDI is not a musical language, nor does it directly describe musical sounds. Rather, it is a data communications protocol, an agreement among manufacturers of music equipment, computers, and software that describes a means for music systems and related equipment to exchange information and control signals.
** page 7 Messages
Each message describes a particular event - the start of a musical note, the change in a switch setting, the motion of a foot pedal, or the selection of a sound 'patch', for example.
** page 8 Note on message for musicians
Musicians generally think of music as a series of notes, each one having a particular pitch, amplitude, and timbre. For musicians, then, a note can be considered the most basic of musical messages. Likewise, the most basic MIDI message is the Note On message, though a Note On message differs from our usual understanding of a musical note. Both contain pitch and loudness data, but elements of expresiveness such as vibrato and pitch bend are treated as separate MIDI messages rather than as part and parcel of each note that they affect.
** page 11 Limitations of MIDI
MIDI is not without its shortcomings, however. One is that the MIDI specification does not describe what MIDI devices must do, only how to communicate something if the manufacturer decides to do it. Few MIDI devices will incorporate all the potential power of MIDI, so it is up to the person who buys and uses a MIDI device to find out what ic can and cannot do. Capabilities range from simple one-voice Note On/Note Off generators to complicated systems with touch sensivity, keyboard splits, and modulation control.
Nor does NUDU specify particular sounds that an instrument must make or the quality of the sounds that it does make. The range and quality of sounds from MIDI synthesizers vary from numerous and wonderful to few and awful, and MIDI itself will not help you determine which synthesizer has which. (ends page 12)
** page 139 Understanding MIDI messages
MIDI messages are the means by which one MIDI device communicates information to another MIDI device. Each message specifies a musical event - in order to understand why a particular device acts in a particular manner, you must understand what messages it is receiving and transmitting. Most sequenceres, and some other devices, can display MIDI messages (oftern in a variety of formats), allowing sequencer users to examine and alter MIDI messages one by one.
MIDI messages consist of one or more bytes of digital data.
Each MIDI message byte begins with a start bit (logical 0), followed by eight message bits sent with the least significant bit first, and terminated by a stop bit (logical 1), for a total of ten bits per serial byte. Each eight-bit message byte specifies either a status or data value; the first byte of each message is the status byte, which specifies the type of message and how many additional data bytes follow to make up the complete message. Status bytes always have a most sifnificant bit of 1, while data bytes always have a most significant bit of 0. Data bytes thus always range from a minimum value of 0 to a maximum value of 127 (decimal).
** page 140 Categories of MIDI messages
MIDI messages may be grouped into two major categories, channel messages and system messages. Channel messages specify a particular MIDI channel within the message and generally control such aspects of performance as Note On/Note Off, Continuous Controller, and Program Change. 
Channel messages may themselves be grouped into channel mode messages and channel voice messages, while system messages may be grouped into system real time and system common messages and the single System Exclusive messages
*Channel Mode Messages*
Channel mode messages affect the device that receives them only when they are sent over the channel to which the receiving device is assigned. That assignment of basic channel cannot be set or changed by any MIDI mode or voice message but may be set in one of three ways: permanently by the device's manufacturer; from the front-panel controls of the device, or by transmitting an appropriate System Exclusive message to the device.
Channel mode messages are used primarily to select one of the four MIDI modes described in the previous chapter. Each channel mode message is three bytes long. The four most significant bits of the channel mode status byte are 1011, while the four least significant bits designate one of MIDI's sixteen channels, from 0000 for channel 1 to 1111 for channel 16. (ends page 141)
** page 142 Channel Voice messages
Channel voice messages specify the nature of sounds produced by the synthesizer that receives the messages, using the channel number embedded in the status byte of the message. The events described by channel voice messages include Note On, Note Off, Channel Pressure, Polyphonic Key Pressure, Program Change, Control Change, and Pitch Bend.
*Note On*
A Note On message signals the device receiving it to begin playing a note. Note On messages are generated by a MIDI keyboard when a key is pressed or when some other MIDI device is similarly triggered. (ends 143)
