docs/site/rothstein92_midi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rothstein92_midi</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">rothstein92_midi</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#rothstein92_midi">Midi: a comprehensive introduction</a>
<ul>
<li><a href="#org5999d9b">page 1 What is MIDI</a></li>
<li><a href="#org26fd6bc">page 7 Messages</a></li>
<li><a href="#org64b07e9">page 8 Note on message for musicians</a></li>
<li><a href="#org81573eb">page 11 Limitations of MIDI</a></li>
<li><a href="#orge8d419d">page 139 Understanding MIDI messages</a></li>
<li><a href="#orgdf3b87a">page 140 Categories of MIDI messages</a></li>
<li><a href="#org6c78c89">page 142 Channel Voice messages</a></li>
<li><a href="#org9985ffd">page 143 Note On/Note Off</a></li>
<li><a href="#org93c63d4">page 144 Channel Pressure, Polyphonic Key Pressure</a></li>
<li><a href="#orga7bce89">page 145 Program Change</a></li>
<li><a href="#org04a6d19">page 146 Program Change / Control Change</a></li>
<li><a href="#orgf0a1870">page 147</a></li>
<li><a href="#org06f596b">page 159 A Final Warning</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-rothstein92_midi" class="outline-2">
<h2 id="rothstein92_midi">Midi: a comprehensive introduction</h2>
<div class="outline-text-2" id="text-rothstein92_midi">
</div>
<div id="outline-container-org5999d9b" class="outline-3">
<h3 id="org5999d9b">page 1 What is MIDI</h3>
<div class="outline-text-3" id="text-org5999d9b">
<p>
MIDI is an acronym for "Musical Instrument Digital Interface." Despite its impact on the world of music, MIDI is not a musical language, nor does it directly describe musical sounds. Rather, it is a data communications protocol, an agreement among manufacturers of music equipment, computers, and software that describes a means for music systems and related equipment to exchange information and control signals.
</p>
</div>
</div>
<div id="outline-container-org26fd6bc" class="outline-3">
<h3 id="org26fd6bc">page 7 Messages</h3>
<div class="outline-text-3" id="text-org26fd6bc">
<p>
Each message describes a particular event - the start of a musical note, the change in a switch setting, the motion of a foot pedal, or the selection of a sound 'patch', for example.
</p>
</div>
</div>
<div id="outline-container-org64b07e9" class="outline-3">
<h3 id="org64b07e9">page 8 Note on message for musicians</h3>
<div class="outline-text-3" id="text-org64b07e9">
<p>
Musicians generally think of music as a series of notes, each one having a particular pitch, amplitude, and timbre. For musicians, then, a note can be considered the most basic of musical messages. Likewise, the most basic MIDI message is the Note On message, though a Note On message differs from our usual understanding of a musical note. Both contain pitch and loudness data, but elements of expresiveness such as vibrato and pitch bend are treated as separate MIDI messages rather than as part and parcel of each note that they affect.
</p>
</div>
</div>
<div id="outline-container-org81573eb" class="outline-3">
<h3 id="org81573eb">page 11 Limitations of MIDI</h3>
<div class="outline-text-3" id="text-org81573eb">
<p>
MIDI is not without its shortcomings, however. One is that the MIDI specification does not describe what MIDI devices must do, only how to communicate something if the manufacturer decides to do it. Few MIDI devices will incorporate all the potential power of MIDI, so it is up to the person who buys and uses a MIDI device to find out what ic can and cannot do. Capabilities range from simple one-voice Note On/Note Off generators to complicated systems with touch sensivity, keyboard splits, and modulation control.
Nor does NUDU specify particular sounds that an instrument must make or the quality of the sounds that it does make. The range and quality of sounds from MIDI synthesizers vary from numerous and wonderful to few and awful, and MIDI itself will not help you determine which synthesizer has which. (ends page 12)
</p>
</div>
</div>
<div id="outline-container-orge8d419d" class="outline-3">
<h3 id="orge8d419d">page 139 Understanding MIDI messages</h3>
<div class="outline-text-3" id="text-orge8d419d">
<p>
MIDI messages are the means by which one MIDI device communicates information to another MIDI device. Each message specifies a musical event - in order to understand why a particular device acts in a particular manner, you must understand what messages it is receiving and transmitting. Most sequenceres, and some other devices, can display MIDI messages (oftern in a variety of formats), allowing sequencer users to examine and alter MIDI messages one by one.
MIDI messages consist of one or more bytes of digital data.
Each MIDI message byte begins with a start bit (logical 0), followed by eight message bits sent with the least significant bit first, and terminated by a stop bit (logical 1), for a total of ten bits per serial byte. Each eight-bit message byte specifies either a status or data value; the first byte of each message is the status byte, which specifies the type of message and how many additional data bytes follow to make up the complete message. Status bytes always have a most sifnificant bit of 1, while data bytes always have a most significant bit of 0. Data bytes thus always range from a minimum value of 0 to a maximum value of 127 (decimal).
</p>
</div>
</div>
<div id="outline-container-orgdf3b87a" class="outline-3">
<h3 id="orgdf3b87a">page 140 Categories of MIDI messages</h3>
<div class="outline-text-3" id="text-orgdf3b87a">
<p>
MIDI messages may be grouped into two major categories, channel messages and system messages. Channel messages specify a particular MIDI channel within the message and generally control such aspects of performance as Note On/Note Off, Continuous Controller, and Program Change. 
Channel messages may themselves be grouped into channel mode messages and channel voice messages, while system messages may be grouped into system real time and system common messages and the single System Exclusive messages
<b>Channel Mode Messages</b>
Channel mode messages affect the device that receives them only when they are sent over the channel to which the receiving device is assigned. That assignment of basic channel cannot be set or changed by any MIDI mode or voice message but may be set in one of three ways: permanently by the device's manufacturer; from the front-panel controls of the device, or by transmitting an appropriate System Exclusive message to the device.
Channel mode messages are used primarily to select one of the four MIDI modes described in the previous chapter. Each channel mode message is three bytes long. The four most significant bits of the channel mode status byte are 1011, while the four least significant bits designate one of MIDI's sixteen channels, from 0000 for channel 1 to 1111 for channel 16. (ends page 141)
</p>
</div>
</div>
<div id="outline-container-org6c78c89" class="outline-3">
<h3 id="org6c78c89">page 142 Channel Voice messages</h3>
<div class="outline-text-3" id="text-org6c78c89">
<p>
Channel voice messages specify the nature of sounds produced by the synthesizer that receives the messages, using the channel number embedded in the status byte of the message. The events described by channel voice messages include Note On, Note Off, Channel Pressure, Polyphonic Key Pressure, Program Change, Control Change, and Pitch Bend.
<b>Note On</b>
A Note On message signals the device receiving it to begin playing a note. Note On messages are generated by a MIDI keyboard when a key is pressed or when some other MIDI device is similarly triggered. (ends 143)
</p>
</div>
</div>
