org-roam/rothstein92_midi.org
** page 143 Note On/Note Off
Like all MIDI messages, the first byte of the Note On message is its status byte. The four most significant bits of the status byte, 1001, identify the message as a Note On and specify that two additional bytes of MIDI data will follow. The four least significant bits of the Note On status byte indicate which channel the message is intended for - from 0000 for channel 1 to 1111 for channel 16.
The second byte of the Note On message identifies which note is called for. Since it is a data byte, its most sifnifcant bit is 0. The MIDI specification designates 128 different ntoes, numbered from 0 to 127, indicated by the remaining seven bits of the second Note On byte. A MIDI note number does not designate a particular pitch; rather, the note generated depends on the note mapping and tuning determined by the synthesizer or sampler producing the note, though synthesizers most commonly assign MIDI note 60 to middle C and interpret each higher value as an additional half-step above middle C. Under this typical synthesizer's interpretation of Note On messages, MIDI note 66 would represent the F-sharp above middle C, MIDI note 54 would represent the F-sharp below middle C, and so forth.
The third byte of the Note On message indicates the velocity (usually interpreted as loudness), from 0 to 127, in the same manner as the second Note On byte specifies note number. Just as the note number does not specify a particular pitch, the velocity value does not specify a particular loudness, which is instead determined by the velocity map of the synthesizer or sampler.
*Note Off*
Each Note Off message signals the end of a note by signaling the device receiving it to turn off one of the notes it is playing. Like Note On, it is a three-byte message - status byte, note data byte, and velocity data byte. The only difference between the two is that the four most signicant bits of a Note Off status byte are 1000, while a Note On has 1001 in the corresponding positions.
A higher velocity value usually is implemented as a note whose release occurs more quickly - a velocity value of 127 specifies the fastest possible release. Release data generally controls how a note dies away; a low velocity value would thus cause the note to die away slowly and a high velocity value would cause it to die away quickly. Not all MIDI devices implement Note On velocity; fewer still implement Note Off velocity. In such cases, the device transmits a velocity value of 64 for each Note On or Note Off message it transmits or ignores any note off velocity values it receives.
** page 144 Channel Pressure, Polyphonic Key Pressure
Channel Pressure messages are sent by those devices that can sense overall pressure on their keys but are not able to distinguish the pressure put on each indivdual key. That is, whichever key is pressed hardest determines the channel pressure value for the entire keyboard. In the same fashion, certain wind controllers transmit channel pressure information based on increasing breath pressure after the initial attck of a note. Depending upon the device, it may transmit one or, more commonly, a stream of Channel Pressure messages during the duration of a held note.
How a device receiving a Channel Pressure message responds depends on teh particular device. Some devices use channel pressure for aftertouch volume; that is, pressing a key harder once the note has begun sounding causes the note to become louder. Other devices use channel pressure to control vibrato - harder pressure results in a faster or wider vibrato. Still other devices use channel pressure to control other parameters or allow you to assign the parameter yourself.
A Channel prsesure message contains two bytes....(rest not relevant and similar to previous bytes)
*Polyphonic Key Pressure*
Polyphonic key pressure acts in a manner similar to channel pressure, except that the Polyphonic Key Pressure message contains an additional data byte specifying a particular note and affects only that note rather than every note of the specified channel. In order for Polyphonic Key Pressure messages to have any effect, the device transmitting messages must be capable of detecting the different pressures put on each of its keys, and the device receiving messages must bea ble to act upon incoming Polyphonic Pressure messages. (more info on bytes)
** page 145 Program Change
The terms /program, patch,/ and /voice/ are used to refer to a particular setting of a synthesizer's controls when the setting produces a specific instrumental timbre or other musical sound. The terms may also refer to the settings on some other MIDI device such as a digital reverberator that, for example, produce a particular reverberation patern. ("Program," used in this context, should not be confused wiht a computer program, sa set of instructions that directs a computer to perform a particular task.)
A Program Change message does not specify the synthesizer settings themselves; rather, the settings are associated with a patch number by the synthesizer, and the Program Change message simply calls up whatever settings the synthesizer associates with that number. Since the settings that produce a sound vary widely from one synthesizer to another, it is much simpler for MIDI just to specify a program number and leave the particulars of what that program number represents to the synthesizer.
A Program Change message has only a status byte and a single data byte. The status byte of a Program Change message has 1100 as its four most significant bits; like all channel messages, the four least significant bits of the status byte specify the channel.
The data byte of the Program Change message selects a patch on the device receiving the message, from patch 0 to 127. Upon receipt of a Program Change message, the device receiving the message calls up the patch corresponding to the patch value in the message.
But because patch numbers are likely to produce very different results on different synthesizers, selecting the same patch number on two different synthesizers offers no assurance that the resulting two sounds will be similar. In other words, patch number 47 might be associated with a flute sound on one synthesizer and a trombone sound on a differnt synthesizer. Genreal MIDI, described in chapter 4, provides a minimum level of patch compatibility anong synthesizers that implement the General MIDI specification. Even then, patches beyond the 128 specified by General MIDI are likely to differ from one synthesizer to another.
Some synthesizers store fewer than the 128 patches the Program Change message can select. If a synthesizer receives a value higher than the number of stored patches, it may ignore the message, select a default patch, or "wrap" the high value around the number of patches to find a value that is the remainder. (ends 146)
