org-roam/rothstein92_midi.org
** page 146 Program Change / Control Change
Other synthesiers and MIDI devices can store many more than 128 patches. In such a case, the user can assign 128 of the device's patches to MIDI's 128 patch numbers at any given time; only those 128 patches (sometimes referred to as the MIDI program table) are accesible using Program Change messages.
Even some synthesizers that cannot store more than 128 patches have a user-defined MIDI Program table. In that way, the user can associate patches on a synthesizer receiving Program Change messages with the same program change numbers used by a transmitting synthesizer or sequencer for similar sounds, but which the receiving synthesizer had previously associated with a different patch number.
*Control Change*
A control Chnage message affects a sound that has already been initiated by a Note On message, altering such parameters as volume or modulation of the note in progress. The message can specify any of 121 specific MIDI controllers - though most transmitting devices generally implement only a few. These include continuous controllers, On/Off switch controllers, data controllers, and undefined controllers.
Continuous controllers can transmit control data over a range of values - normally 0 to 127 (or 0 to 16,383 in the case of high-resolution controllers, discussed below). On/Off switch controllers transmit only one of two possible values - 0 to represent off or 127 to represent on. Data controllers transmit specific data values directly or increment or decrement the value previously sent. Finally, undefined controllers may operate in the same fashion as continuous controllers, switches, or data controllers, but they use controller numbers that have not been assigned within the MIDI specification.
Control Channel messages consist of three bytes ... more on bytes
The second byte specifies a controller number, from 0 through 120 (decimal).
The third byte specifies the setting value for the particular controller specified by the previous byte. Setting values range from 0 to 127, but as we will see, Control Change messages for a particular continuous controller can be linked together to yield an effective range of 0 to 16,383.
** page 147
Controller numbers 0 through 31, as specified by the second byte of a Control Change message, are for continuous controllers - those that generate data over a range of values, such as pedals, levers, wheels, and so forth. Some continous controllers, called bidirectional continuous controllers, are ata  centered position while at rest. Using such a controller involves moving it above or below its centered position. Upon release, a bidirecitonal continuous controller returns once again to its at-rest, centered position.
If more than 128 steps of resolution is needed, controller numbers 32 through 63 can be used to represent the least signicant byte of a two byte value whose most significant byte is represented by the corresponding controller number 0 to 31.
Once the most significant byte and corresponding least significant byte of a single Control Change pair have been sent, subsequent fine adjustments to the controller can be made by sending only the three-byte Control Change message for the least significant byte - the message for the most significant byte does not have to be transmitted again.
By agreement between the MIDI Manufacturers Association and the Japan MIDI Standards Committee, certain controller numbers are desgnated for certain standard musical applications. Some of the most important of these include: controller number 1, modulation wheel or lever; controller number 2, breath controller; controller number 4, foot controller; controller number 7, main volume; controller number 65, portamento; controller number 66, sostenuto; and controller number 67, soft pedal. (ends page 148)
** page 159 A Final Warning
Even if you know and understand all the messages that pass back and forth between MIDI devices, it is easy to overlook this basic principle of MIDI message transmission: Few MIDI devices implement every variety of MIDI message. The MIDI specification does not require that MIDI devices implement any but a very few core features. Unless a device implements a partiuclar feature, it will not respond to incoming messages that call upon that featur. Even if the device does implement a feature, how it implements the feature may be different from how another device omplements it. The only way to be sure is to understand the messages entering a device and observe how the device responds.
